Not sure if we can call that a bug or a feature XD , because what I added in https://github.com/AzBuilder/terrakube/issues/661 is support for [speculative plans](https://developer.hashicorp.com/terraform/cloud-docs/run/remote-operations#speculative-plans) so you can check the possible changes using the CLI before doing a push to the repository.


In TFC when you have a VCS workspace  like this

![image](https://github.com/user-attachments/assets/67ca712f-cc65-45e3-8c2e-f39e4c447b64)

you will get the following when running a apply

```
λ terraform apply
╷
│ Error: Apply not allowed for workspaces with a VCS connection
│
│ A workspace that is connected to a VCS requires the VCS-driven workflow to ensure that the VCS remains the single
│ source of truth.
╵
```

You can only execute a plan like:
```

λ terraform plan
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/alfespa17/simple-terraform/runs/run-sWog3YTpBrM4mzq1

Waiting for the plan to start...

Terraform v1.9.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.next will be created
  + resource "null_resource" "next" {
      + id = (known after apply)
    }

  # null_resource.previous will be created
  + resource "null_resource" "previous" {
      + id = (known after apply)
    }

  # time_sleep.wait_30_seconds will be created
  + resource "time_sleep" "wait_30_seconds" {
      + create_duration = (known after apply)
      + id              = (known after apply)
    }

  # module.time_module.random_integer.time will be created
  + resource "random_integer" "time" {
      + id     = (known after apply)
      + max    = 5
      + min    = 1
      + result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + creation_time = (known after apply)
  + fake_data     = {
      + data     = "Hello World"
      + resource = {
          + resource1 = "fake"
        }
    }

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if
you run "terraform apply" now.

```

I guess I will have to add some missing property in the Terrakube API to show the same error from TFC when trying to run a apply

`Apply not allowed for workspaces with a VCS connection`